In [1]:
## PANDAS

In [3]:
import pandas as pd
import numpy as np

In [10]:
## Series

## Why we need series?
# We can use our own INDEXING. 

# list_series = pd.Series(data = [1, 2, 3])    # data attribute
list_series = pd.Series([1, 2, 3])     # in List
array_series = pd.Series(np.arange(1, 10))
dict_series = pd.Series({ 'name': 'logesh', 'age': 22 })

print(f"List :\n {list_series}")
print(f"Array :\n {array_series}")
print(f"Dict :\n {dict_series}")

List :
 0    1
1    2
2    3
dtype: int64
Array :
 0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32
Dict :
 name    logesh
age         22
dtype: object

In [8]:
## Custom Index

characters = pd.Series(['A', 'B', 'C'], index = ['USA', 'IND', 'USSR'])

print(f'Custom Indexing : {characters}')

Custom Indexing : USA     A
IND     B
USSR    C
dtype: object

In [13]:
# Concatenation over two series

## While concatenation, no need to have a same INDEX value. By default, it will take 'NaN' if it value is
##...present only in any one of the Series

## Addition
# series1 = pd.Series(data = [10, 20, 30], index = ['USA', 'USSR', 'IND'])
# series2 = pd.Series(data = [30, 40], index = ['USA', 'IND'])

## Concatenation
series1 = pd.Series(data = ['logesh', 'mano', 'kamal'], index = ['USA', 'USSR', 'IND'])
series2 = pd.Series(data = ['logu', 'guru'], index = ['USA', 'IND'])

series1 + series2


############## End <pandas.Series> ##############

IND      kamalguru
USA     logeshlogu
USSR           NaN
dtype: object

In [20]:
## DataFrames(WorkHorse of Pandas) - Table Stuctured Data

df = pd.DataFrame(np.random.rand(5, 4))
df

          0         1         2         3
0  0.877587  0.949264  0.478167  0.461119
1  0.637289  0.324608  0.117578  0.051101
2  0.637659  0.812266  0.670260  0.651768
3  0.424569  0.656595  0.209161  0.659925
4  0.529623  0.748520  0.093757  0.784522

In [21]:
## Custom Indexing in DataFrames
df = pd.DataFrame(np.random.rand(5, 4), index = ['a', 'b', 'c', 'd', 'e'], columns = ['A', 'B', 'C', 'D'])

df

          A         B         C         D
a  0.687242  0.695078  0.496867  0.975361
b  0.203528  0.299020  0.227656  0.048169
c  0.903971  0.080104  0.607216  0.630847
d  0.377942  0.013241  0.842219  0.384938
e  0.551666  0.710538  0.675279  0.694565

In [27]:
## Accessing the DataFrames

df['A']

a    0.687242
b    0.203528
c    0.903971
d    0.377942
e    0.551666
Name: A, dtype: float64

In [28]:
type(df['A'])    # type of COLUMN => Series

pandas.core.series.Series

In [29]:
df.loc['a']

A    0.687242
B    0.695078
C    0.496867
D    0.975361
Name: a, dtype: float64

In [30]:
type(df.loc['a'])   # type of ROW => Series

pandas.core.series.Series

In [31]:
## Creating New Column

df['new_col'] = ['USA', 'USSR', 'ENG', 'SA', 'SL']

df

          A         B         C         D new_col
a  0.687242  0.695078  0.496867  0.975361     USA
b  0.203528  0.299020  0.227656  0.048169    USSR
c  0.903971  0.080104  0.607216  0.630847     ENG
d  0.377942  0.013241  0.842219  0.384938      SA
e  0.551666  0.710538  0.675279  0.694565      SL

In [32]:
## Dropping Column

df.drop('D', axis = 1)

          A         B         C new_col
a  0.687242  0.695078  0.496867     USA
b  0.203528  0.299020  0.227656    USSR
c  0.903971  0.080104  0.607216     ENG
d  0.377942  0.013241  0.842219      SA
e  0.551666  0.710538  0.675279      SL

In [38]:
df

          A         B         C new_col
a  0.687242  0.695078  0.496867     USA
b  0.203528  0.299020  0.227656    USSR
c  0.903971  0.080104  0.607216     ENG
d  0.377942  0.013241  0.842219      SA
e  0.551666  0.710538  0.675279      SL

In [40]:
## By default drop() willn't remove the column permanently from DataFrame.

## We should specify 'inplace = True' to remove the column permanently from the DataFrame

## Way - 1
# df = df.drop('C', axis = 1)
# df


df.drop('C', axis = 1, inplace = True)
df

          A         B new_col
a  0.687242  0.695078     USA
b  0.203528  0.299020    USSR
c  0.903971  0.080104     ENG
d  0.377942  0.013241      SA
e  0.551666  0.710538      SL

In [41]:
df

          A         B new_col
a  0.687242  0.695078     USA
b  0.203528  0.299020    USSR
c  0.903971  0.080104     ENG
d  0.377942  0.013241      SA
e  0.551666  0.710538      SL

In [42]:
## Addition

df['Addition'] = df['A'] + df['B']
df

          A         B new_col  Addition
a  0.687242  0.695078     USA  1.382321
b  0.203528  0.299020    USSR  0.502548
c  0.903971  0.080104     ENG  0.984075
d  0.377942  0.013241      SA  0.391183
e  0.551666  0.710538      SL  1.262204